---
kind: type
id: T:Autodesk.Revit.DB.Events.RevitEventArgs
source: html/2995a67a-3135-8032-a92a-079b6f9d6954.htm
---
# Autodesk.Revit.DB.Events.RevitEventArgs

The class is used as base class for all event argument classes.

## Syntax (C#)
```csharp
public class RevitEventArgs : EventArgs
```